e2e/artillery-tests/text-chat-load-test.yaml

# run with `artillery run artillery.yaml`
config:
  target: "http://127.0.0.1:7203"
  phases:
    - duration: 10
      arrivalRate: 1
  variables:
    greeting: ["hello", "goedemorgen", "добрый день", "guten tag", "bonjour", "hola"]
  socketio:
    query:
      test: d0934i2*@!*%j4fehg0[]sdf,af2

scenarios:
  - name: "A chatty user"
    weight: 10
    engine: "socketio"
    flow:
      - loop:
        - emit:
            channel: "send-message"
            data:
              server_id: "5ada5c98d89838316c432221"
              channel_id: "5ada5c98d89838316c432237"
              message: '{{ greeting }}'
        - think: 0.2
          count: 50
      - think: 240