e2e/artillery-tests/text-chat-load-test.yaml

# run with `artillery run artillery.yaml`
config:
  target: "http://127.0.0.1:7202"
  phases:
    - duration: 20
      arrivalRate: 1
  variables:
    greeting: ["hello", "goedemorgen", "добрый день", "guten tag", "bonjour", "hola"]
  socketio:
    query:
      test: d0934i2*@!*%j4fehg0[]sdf,af2

scenarios:
  - name: "A chatty user"
    weight: 10
    engine: "socketio"
    flow:
      - loop:
        - emit:
            channel: "send-message"
            data:
              channel_id: "5a8c2a3d1b387a4d78e910b7"
              server_id: "5a8c2a3d1b387a4d78e910b2"
              message: '{{ greeting }}'
        - think: 1
          count: 10
      - think: 240