e2e/artillery-tests/text-chat-load-test.yaml

# run with `artillery run artillery.yaml`
config:
  target: "http://127.0.0.1:7203"
  phases:
    - duration: 10
      arrivalRate: 1
  variables:
    greeting: ["hello", "goedemorgen", "добрый день", "guten tag", "bonjour", "hola"]
  socketio:
    query:
      test: d0934i2*@!*%j4fehg0[]sdf,af2

scenarios:
  - name: "A chatty user"
    weight: 10
    engine: "socketio"
    flow:
      - loop:
        - emit:
            channel: "send-message"
            data:
              channel_id: "5ace3eac3f26c021df9e40fb"
              server_id: "5ace3eac3f26c021df9e40ed"
              message: '{{ greeting }}'
        - think: 0.05
          count: 1
      - think: 240